# Conectar a MySQL

In [ ]:
import pandas as pd
import pymysql

%load_ext sql

db_host = "localhost"
db_port=3306
db_user = "usuario"
db_passwd="abc123."
db_name="employees"

connectionString=f'mysql+pymysql://{db_user}:{db_passwd}@{db_host}:{db_port}/{db_name}'

%sql $connectionString

In [ ]:
%sql SELECT COUNT(*) FROM salaries;

In [ ]:
df = %sql SELECT * FROM salaries;

In [ ]:
df.DataFrame().head(5)

In [ ]:
#import sqlalchemy
from sqlalchemy.engine import create_engine

engine = create_engine(connectionString)

cadenaSQL = "SELECT * FROM departments"
#result=engine.execute(cadenaSQL)
df2 = pd.read_sql(cadenaSQL, engine)
df2.head()

In [ ]:
state='FINISHED'
%sql SELECT :state as "bind_variable"

## Conectar a sql y descargar parquet

In [1]:
import pandas as pd

* Conexion

In [13]:
db_host = "localhost"
db_port = 3306
db_name = "employees"
db_user = "usuario"
db_pass = "abc123."

connectionString = f"mysql+pymysql://{db_user}:{db_pass}@{db_host}:{db_port}/{db_name}"

* Consulta a Dataframe

In [10]:
df = pd.read_sql("SELECT * FROM salaries", con=connectionString)
df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

* A parquet

In [11]:
df.to_parquet("salaries.parquet")

* De Parquet a Dataframe

In [12]:
df = pd.read_parquet("salaries.parquet")
df

         emp_no  salary   from_date     to_date
0         10001   60117  1986-06-26  1987-06-26
1         10001   62102  1987-06-26  1988-06-25
2         10001   66074  1988-06-25  1989-06-25
3         10001   66596  1989-06-25  1990-06-25
4         10001   66961  1990-06-25  1991-06-25
...         ...     ...         ...         ...
2844042  499999   63707  1997-11-30  1998-11-30
2844043  499999   67043  1998-11-30  1999-11-30
2844044  499999   70745  1999-11-30  2000-11-29
2844045  499999   74327  2000-11-29  2001-11-29
2844046  499999   77303  2001-11-29  9999-01-01

[2844047 rows x 4 columns]